{
  "by" : "jerf",
  "id" : 31123449,
  "kids" : [ 31124402 ],
  "parent" : 31123174,
  "text" : "Also: Airplane! and Airplane 2 DVD: $6. <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;dp&#x2F;B06XGD93BP\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;dp&#x2F;B06XGD93BP</a> Spaceballs $7, less if you&#x27;re ok with used: <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;dp&#x2F;B004TJ1H32\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;dp&#x2F;B004TJ1H32</a> Cannonball run, $10, though less if used and there are some $10 &quot;Cannonball Run + another movie&quot; sets on Amazon as well.<p>While I tend to agree that piracy and&#x2F;or ripping isn&#x27;t something everyone can do, I&#x27;ve filled out my Plex collection legally lately with DVD acquisitions at bargain-bin prices. Used doesn&#x27;t matter if you only have to be able to read the disc once to rip it, and I&#x27;m yet to get something used off Amazon that couldn&#x27;t be read once. (I haven&#x27;t even had to clean it or anything, it&#x27;s all just worked.)<p>So, my Plex install in terms of raw content isn&#x27;t up to Netflix&#x27;s size. However, I rather suspect there are some people reading this who have more hours of video on their Plex than Netflix even has available. And while mine isn&#x27;t that large, it is <i>much</i> better tuned for me and my family&#x27;s interests at this point. And I don&#x27;t have to worry about getting halfway through a series, only for some licensor to notice it has become popular enough to pull it and run it on their own service. Netflix has the problem now that anything that becomes popular on their service will get yanked. I do not know how they overcome that. They hoped to do it with enough original content, but to my eye, that has failed, and there is now no longer enough time to fix that. While I understand the complaints that they treated it too much like &quot;content&quot;, to be honest, I&#x27;ve never thought this would work out, from the moment they announced it. A single company just can&#x27;t produce a sufficiently diverse set of &quot;content&quot; to be the everything-to-everybody they would have needed to be to justify a Netflix valuation.",
  "time" : 1650643706,
  "type" : "comment"
}
