{
  "by" : "otterley",
  "id" : 31129035,
  "parent" : 31128740,
  "text" : "&gt; forces us to nonsensically pretend that differences can only be positive in cooperative environments<p>What is &quot;forcing&quot; you to do this? The D&amp;I training I&#x27;ve been taking has been about finding positivity in differences to our mutual advantage, but never does it say that all aspects of it are 100% positive. People are always going to find areas of disagreement. Yet we find ourselves working together, and so we must find ways to collaborate as a team despite those differences, even to the point of respecting them.<p>&gt; Because it suggests that minorities need special advantages to level the playing field?<p>The evidence on this is pretty clear, because several minorities do suffer from historical poverty (in money, in education, and quality of life) that has been very difficult to overcome. A lot of damage was done prior to the Civil Rights Act through mechanisms specifically intended to keep Black people down, and we haven&#x27;t recovered from that yet. We&#x27;re getting <i>better</i>, but I don&#x27;t think we can just put our heads in the sand and conclude that the Civil Rights Act was the end of our journey to remedy the terrible legacy of slavery and racism.<p>&gt; all inequities are exclusively the result of discrimination on behalf of white males who have been made into a target, are having their voices silenced, their job opportunities removed<p>You <i>cannot</i> be serious about the silence of white voices in the media. Maybe some individuals are being silenced (see below), but the sentiments certainly are not.  For every 1 person who may have been silenced, it&#x27;s easy to find thousands who haven&#x27;t, whose opinions track roughly identically. And those people who have been &quot;silenced&quot; seem to have no trouble getting their voices heard through other avenues. Alex Jones still has plenty of mouthpieces, as does Donald Trump. (Both also happen to <i>own</i> several of those mouthpieces...)<p>And it is especially ironic when a person claims they are being silenced... on Twitter, and then when it is republished through various blogspam ad nauseam.<p>&gt;  ...their livelihoods threatened for self advocating?<p>I think it depends on the nature of the advocacy in question. If you&#x27;re saying, &quot;I want the opportunity to learn, to work hard, and be successful,&quot; I would be very surprised if people were to threaten your livelihood over that. On the other hand, if your advocacy consists of lies, exaggerations, and hysterics, then people might not want to associate with you.<p>I don&#x27;t accuse anyone of being a bigot because they have genuine and good-faith concerns about whether we are remedying social inequity the wrong way. It&#x27;s when they flat-out lie, deny the past, make racist remarks themselves, or make themselves out to be the victim without evidence that they deserve that moniker.",
  "time" : 1650666706,
  "type" : "comment"
}
