{
  "by" : "kmeisthax",
  "id" : 31124883,
  "kids" : [ 31125687 ],
  "parent" : 31123354,
  "text" : "Ugh. Never before have I seen a comment that I&#x27;ve agreed with so much but also wanted to yell at at the same time.<p>To put it really bluntly, pointing out how piracy is easier than paying again is not literally stealing money out of your pocket. The whole &quot;lost sales&quot; and &quot;stolen income&quot; thing doesn&#x27;t always hold water, because you can&#x27;t measure all the counterfactuals involved. A <i>lot</i> of pirates are either just data hoarders or collectors, and you aren&#x27;t really in price competition with piracy as long as you are even slightly more convenient than it. Yes, that actually used to be the case for movies and TV shows, back when you could get access to everything you could ever want to watch just by subscribing to Netflix or maybe Hulu. Piracy was actually <i>going away</i>, right up until everyone pulled their content from Netflix to try and grab a larger slice of a smaller pie.<p>However, I don&#x27;t want to actually trash your point <i>too hard</i>, because you did touch upon something worth talking about. I have noticed in HN and in other engineer-oriented spaces a certain contempt for the creative working class. I call it &quot;kill and eat everyone below the talent line&quot;.<p>There&#x27;s this weird meme that came about around the same time that the RIAA was indiscriminately suing casual pirates. Back then, <i>some</i> artists - usually ones at the start of their careers or doing it as a hobby - were distributing content over the Internet for free. In fact, some of them were even able to make money off of it through crowdfunding or advertisements without directly demanding payment to read, listen, or watch their work. So people made this assumption that this business model would be both sustainable long-term and scalable to large productions. Ergo, copyright is just an artifice of history, we can just abolish it, and the &quot;real artists&quot; will prosper while publishers and middlemen are out of  a job.[0]<p>The problem is that &quot;real artists&quot; covers both the Toby Foxes of the world just as well as the Temmie Changs. Abolishing copyright beggars the songwriter in the name of the singer. A-list actors would actually survive and thrive in a crowdfunding-only market, because they have the name recognition to do so. But all the other people who support them would see their income shrink. And producers and publishers would just turn into the absolute worst kind of scummy for-sale pirates you could think of.[1]<p>The thing about piracy is that we as tinkerers and hobbyists assume it works exactly the same for everyone else as it does for us. I.e. me and my 10,000 friends all trade files around for free. Yes, a lot of pirates <i>are</i> data hoarders and collectors, but there&#x27;s an entire world of bootlegs and knockoffs outside of the world of BitTorrent. For-profit piracy is far more pernicious than just the person with a Plex server, and it comes in a lot of forms you wouldn&#x27;t even expect. For example, when Facebook launched their video service, there was an entire cottage industry of people reuploading YouTube videos and monetizing them on Facebook. This is the sort of thing that individual filesharers would not even recognize as piracy, but is absolutely immoral and wrong, and does pull nickels and dimes out of artists&#x27; pockets.<p>[0] The counterargument I&#x27;m making against copyright abolitionism does not apply to other things like shortening the length of copyright terms or adding more exceptions to it. Those at least still allow the existence of a creative working class.<p>[1] Fun fact: lousy speedsubbing jobs aren&#x27;t just for modern anime pirates. Before we had international copyright, it was common for publishers to just take books published in other countries, translate themselves, and sell them before the original author could.",
  "time" : 1650648307,
  "type" : "comment"
}
