{
  "by" : "panick21_",
  "id" : 31129745,
  "kids" : [ 31130206, 31130520 ],
  "parent" : 31129152,
  "text" : "Nonsense, its simply that if writers are engaged in social signaling some of that results in much worse shows and that is seriously annoying.<p>Consider two shows that I watched in the same Week, Wheel of Time and Arcane. Both shows have a very clearly modern perspective, and are very much in line with what we might call &#x27;woke&#x27; culture.<p>Arcane did this in a brilliant way, a great love story between female leads of the show. Genuinely showing lower class struggle, corruption and so on. Both the villains and the heroes (and in between) have a wide range perspectives, capabilities and identities. Great show, well executed.<p>Wheel of Time had a writer who made it a clear mission statement to transform the source material into a woke version of itself, going so far as to say &#x27;this is how it would have been written today&#x27;. The show also has a female lead in a lesbian relationship, but one that feels forced and has little emotional core. Unlike Arcane there is a clear trend where females were powered up to a sometimes a hilarious degree, all antagonists were stereotypical boring men and all the main leading male characters were basically boring did basically nothing and their many story somehow relates to their relationship with a powerful women.<p>If &#x27;Wheel of Time&#x27; was just another show, it would just be a badly written show. However that it is adoption of well known source material shows the writers bias and political message quite clearly.<p>Almost nobody is against LGBT characters or show that have woke politics in them. Its when it is badly done that it is annoying.<p>The same in the past would apply to war propaganda movies. If its a very well done and executed it can be great content. But most that produced with that goal in mind is just lame.<p>To suggest that the majority of people who criticizes shows for &#x27;wokeism&#x27; are just LGBT haters is absurd. Its equally wrong as to suggest that all people who object to war propaganda movies are pacifists.<p>The reality is that these studies want shows with these kinds of messaging in them and that a great deal of content ponders to that political outlook. Just as in the past content providers have pondered to politics as well. It does not mean you disagree with the political outlook, it just means I don&#x27;t need it to be shoved into my face at every opportunity by lazy writers.",
  "time" : 1650671541,
  "type" : "comment"
}
