{
  "by" : "michaelmrose",
  "id" : 31126229,
  "parent" : 31124350,
  "text" : "The world is full of problems. We are looking at actual massive potentially civilization or species ending issues in the large and dealing with trying to make a living, manage illness, deal with death, parenting in the small.<p>If you live in a big city you probably walk by people in the street slowly dying from a drawn out form of suicide because you can&#x27;t possible change all their lives on your way to the grocery store or coffee shop and people at large are choosing to do the same with your income stream. They opt to deal with problems more important and more personal than fixing the way in which culture is monetized so as to funnel slightly more money to rich folks who could do more for society as soylent green in hopes that a few extra bucks will stick to the hands of useful folks like yourself.<p>For myself I&#x27;m not angry nor do I have any intention of fixing the problem because nobody with any decision making power gives two shits what my opinion on  anything is. I have monetarily in life about nothing and indeed will have nothing tomorrow and the next day. You feel like people are violating the social contract by not paying for multimedia. Part of your problem is that you even believe that we are part of the same society or share the same ethics.<p>We really aren&#x27;t. I am not the benefactor of the current situation nor do I have any meaningful power to negotiate new ground rules or even enforce existing ones so rejection makes worlds more sense.<p>You say stop downloading and I hear enjoy poverty but with fewer books, music, movies, games. I wont actually be supporting the folks you mentioned to any greater degree but you will find such more ethically palatable. HALF of America is sharing 12% of the income. We don&#x27;t have anything but you can stick a $200 PC  and plug it into a $20 monitor and courtesy of a $10 internet essentials package download as many books music movies shows as you can possibly consume.<p>I don&#x27;t feel like making my shitty life shittier in order for you to feel better. Artificial scarcity is a dumb way to run a society and its not my fault the people with all the money in this society have chosen it.",
  "time" : 1650653069,
  "type" : "comment"
}
