{
  "by" : "everdrive",
  "id" : 31123429,
  "kids" : [ 31124019, 31130809 ],
  "parent" : 31122774,
  "text" : "Political themes in TV shows are pretty ubiquitous these days. In part this is because US politics are more interested in &quot;culture war&quot; issues than they are with specific political platforms. In other words, culture war issues tend to deal with moral and social values. In a previous time, political issues might be much more limited in scope: what should the government tax? Which regulations are helpful? etc.<p>&quot;Culture war&quot; issues tend to be a bit more subtle, and can usually be ignored as valid plot devices. There&#x27;s not even anything explicitly wrong with adding your own cultural values to a movie, but rather it can get pretty overbearing, even if you tend to agree.<p>A good way to look out for these themes is to look at the characters and ask some basic questions:<p>- Which characters in the show are in charge? What groups (racial, sexual, etc) are they from?<p>- Which characters in the show are competent? What groups are they from?<p>- Which characters in the show are the villains? What groups are they from?<p>- Which characters in the show are the victims? What groups are they from?<p>- Which characters have &quot;good&quot; traits such as humility, kindness, etc?<p>- Which characters are shown to be bigots?<p>- etc.<p>This can get a bit more complex, too. The solutions to problems, or explanations for the ills of the world might also follow culture war lines. Who are the bad guys? Are they from a corporation? From the government? From a certain gender or ethnic group? etc.<p>A great example of this might be the Mulan remake vs. the original. In the remake, much of the movie is occupied with showing how Mulan is better than everyone, and then quickly cutting to show face-shots of men who are either severely intimated, cowed, afraid, or impressed. I&#x27;m not suggesting there is anything wrong with this. Rather I&#x27;m just making the point that this was added to the movie for political and cultural reasons. The original cartoon didn&#x27;t really have much comeuppance in this way, because it was written during a different time.<p>Again, I don&#x27;t think there&#x27;s anything wrong with people putting their political views into shows -- really, that&#x27;s inevitable at some level. But, there&#x27;s also a certain level where it becomes too over the top, too sanctimonious, too pervasive, and you just want to get away from it all.",
  "time" : 1650643640,
  "type" : "comment"
}
