{
  "by" : "cupofpython",
  "id" : 31126433,
  "parent" : 31124328,
  "text" : "&gt;if you watch it with your friends, 5 people watch it for one purchase. If it&#x27;s good, you all tell 3 more people. Of those 15 people, 20 percent end up purchasing a viewing and the system repeats.<p>or he could have not watched it at all, told no one, and you would have 0% instead of 20%.<p>Pirating at scale is a real problem, but an individual pirate is just an opportunist.  There is a difference between taking something off the shelf vs picking it out of the trash.<p>There is a small volume of &quot;piracy&quot; that could be considered &quot;picking through the trash&quot;.  Some (a lot) of entertainment looks like trash to some (a lot) of people and the only reason those people watch it is because it they get to watch it for free.  And then when they are pleasantly surprised, they tell people about it.  This is the heart of the &quot;i wasnt going to pay for it anyway&quot; argument. Its the type of person who wouldnt pay for a donut, but if you were about to throw them out theyll take one.<p>Id be curious to see statistics that shows the relation of being successful in the pirate world and successful in the real world.  Because that is ultimately related to the argument you are making.  that the current state of piracy is hurting your industry, not helping it - since you say this specific pirate is hurting you right now.<p>it certainly hurts the transactions bottom line when isolated to viewing your bottom line with or without pirate sales - but thats an incomplete financial scenario (this type of thing is <i>my</i> job).  you shouldnt assume a gain of x% sales of pirates that &#x27;would have paid for the content if they couldnt get it for free&#x27; without also <i>subtracting</i> y% of sales from people &#x27;who only bought it because pirates started the conversation that ultimately led to their purchase&#x27;.<p>Sometimes the marketing for a movie sucks, and not a lot of people are interested in seeing it.  There is a small time frame of relevance and pirates might help overcome the shortcomings of marketing efforts and make the movie more relevant which helps it reach more people than it would have.<p>In all of your discussion, you seem to presume that the pirates knew about and had an interest in your film to begin with.  You assumed successful marketing of your film.  maybe you&#x27;re right, and it probably does &#x27;hurt&#x27; (tax?) the biggest blockbuster of the year... but &#x27;people who only watch things online for free&#x27; is a real community of maybe significant size and i dont know if there has been any work done to try to measure the impact of what penetrating that community has on the financial success of entertainment media in general.<p>&quot;all theft is bad&quot; is a nice story, but it ultimately is not always true. sometimes companies <i>allow</i> theft on purpose as a form of marketing.  They do that as an observational response to the fact that the cause and effect of &#x27;influencers&#x27; exists outside of the intent of the people involved.<p>This leads to a hypothesis that pirating is a form of marketing for your industry.  If it were to become too easy to perform or too widespread, it would likely cross a line into being actually damaging.  But if the people pirating it are mostly a small group of tech savvy, relatively intelligent, movie enthusiastic people (due to the technical requirements needed to pirate) then maybe when they pirate you they might be autonomously servicing your industry as an influencer.  I know it sounds asinine, but if you want to talk money - there are a lot of factors to consider.<p>So are they stealing? sure.  Are they taking money OUT of your pocket? very debatable; unclear.  They are influencing with the pool of money that ends up in your pocket, and it isnt so black and white what their actions have on the size of that pool due to the complexity of your industry.<p>---------------\nSorry for the long post, and it isnt an attack on you or even a support of piracy in general (it might read that way) - i got caught up in mentally exploring the underlying financial model at play in the current market.  fwiw im too lazy to pirate, but i still feel there is an incredible difference between people who pirate for themselves vs people who make it easy for others to pirate.  People who invite some friends over to watch something they pirated, vs someone who distributes pirated content on common low-tech household media formats like USB, CD, etc.",
  "time" : 1650653837,
  "type" : "comment"
}
