{
  "by" : "cercatrova",
  "id" : 31122389,
  "kids" : [ 31122684, 31122727, 31122591, 31124505, 31122441, 31122962, 31123177, 31123039, 31122837, 31122866, 31122968, 31123355, 31124853, 31127106, 31124670, 31122796, 31123354, 31123644, 31123240, 31123045 ],
  "parent" : 31120094,
  "text" : "It&#x27;s easier just to pirate than keep up with all these streaming services.<p>- You get the benefit of high quality (true 4k, not stream compressed &quot;4k&quot;) and no buffering.<p>- Plex, Radarr, Sonarr automatically downloads and categorizes your content for you, you can just sit back and enjoy your content.<p><pre><code>    - Edit: Plex et al are not the *only* ways to download content, not sure why some replies are thinking so. I too can type in a show into a piracy site, click the magnet icon, and start immediately watching it. I personally don&#x27;t even use Plex, Radarr or Sonarr myself, it was just a suggestion. In contrast, I can&#x27;t just type any show into Netflix and watch it, since it might not even be on Netflix! Then I&#x27;d need to get on justwatch.com just to figure out which streaming service is playing the show. This is harder than piracy in my view.\n</code></pre>\n- You can use whatever media player you want without having to go through a browser and its DRM. I use mpv and filters like Anime4k to automatically upscale my content, something that I cannot do via a browser or otherwise without the physical file on my hard drive.<p>- You&#x27;re not geo-locked to content, just because you&#x27;re not in the target country doesn&#x27;t mean you wouldn&#x27;t want to watch it.<p>- Oh, and you can share with as many of your friends as you want without a restrictive password sharing penalty like Netflix seems to want to start enforcing.<p>Now, what <i>would</i> be a good model to stop such piracy? Something like Steam or Spotify but for movies and shows:<p>Perhaps a paid Plex server where I get all content from every distributor for a flat fee, and the service provider can then pay out to each distributor their portion of my subscription based on number of views. I retain access to the physical files without DRM so that I can do with them what I want, such as applying mpv filters.<p>Hell, it&#x27;s probably in the best interest of all distributors to band together because clearly everyone having their own subscription service is a race to the bottom. See Netflix here struggling to make original content because major distributors like Disney and Paramount have already left. See CNN+ that shut down one month after starting. Due to the tragedy of the commons, where each distributor thinks they can make more money via starting their own service, this hypothetical new service would have to be some sort of joint venture between them all so that no one is incentivized to start their own.",
  "time" : 1650639549,
  "type" : "comment"
}
