{
  "by" : "rewgs",
  "id" : 31128285,
  "kids" : [ 31128297 ],
  "parent" : 31125100,
  "text" : "&gt; But what if someone is not pirating instead of purchasing, they&#x27;re just pirating instead of doing something else?<p>By &quot;something else&quot; do you mean &quot;another activity <i>instead of</i> watching TV&#x2F;movies&#x2F;etc,&quot; or do you mean &quot;watching TV&#x2F;movies&#x2F;etc, just via another method?&quot;<p>If the former...who cares? That still doesn&#x27;t justify it. Just because I chose another recreation activity instead of watching a movie doesn&#x27;t mean that I&#x27;m entitled to the movie for free. <i>Not choosing</i> something doesn&#x27;t have an effect on the price (at least on the micro level; on the macro level, this is of course the concept of &quot;demand,&quot; but even if the demand is so low that the &quot;correct&quot; price is effectively $0, that still doesn&#x27;t give you the right to steal it -- the Intellectual Property is still <i>property</i> of the owner, and they are the only ones who have the right to sell it or give it away, just as you or I have the right to sell or give away any of our property, be it a couch, a TV, a pair of shoes, an idea for a story, whatever. It&#x27;s all property).<p>If the latter, what could possibly fit that criteria? You&#x27;re either getting the TV&#x2F;movie via official methods or piracy, there isn&#x27;t any other way. It&#x27;s binary. There isn&#x27;t a way to get your hands on a film that is neither officially sanctioned nor piracy.<p>&gt; You need to consider that maybe the product you are producing is simply not that valuable.<p>Not that valuable? Are you serious? We&#x27;re talking about products that are considered &quot;low budget&quot; when they cost 1 million dollars to make and at best receive profits of hundreds of millions of dollars. The entire premise of this thread is that everyone <i>wants</i> to watch everything, they <i>want</i> access to everything (i.e. the demand is high and not going anywhere). They just don&#x27;t want to pay for multiple separate services -- but only because they can compare to and prefer the brief, golden period wherein everything was accessible on Netflix and Hulu, back when they were the only two games in town and were a breath of fresh air compared to the expensive cable packages (which, might I remind you, people <i>still</i> paid -- economically, that means that the price is considered &quot;fair&quot; and commensurate to demand). Back when Netflix and Hulu were both unsustainably hemorrhaging money, I might add.<p>Paying for 100% of the streaming services now costs &lt;= your typical cable package just 20 years ago, and that&#x27;s not even adjusting for inflation. So things are <i>still</i> cheaper than they&#x27;ve ever been, with a not-insignificant raise in convenience and overall quality of the product to boot. Had we jumped from cable packages to the current situation, HN would be jumping with joy.<p>Just be honest: you want what you want, for as little as you can get it for. And that&#x27;s fine! That&#x27;s human nature. What&#x27;s not fine is, because you can get it for $0 pretty much risk-free, you&#x27;ll bend over backwards defending why doing so is okay.<p>(Comment too long for HN, continuing in the next one...)",
  "time" : 1650662329,
  "type" : "comment"
}
