{
  "by" : "jtuple",
  "id" : 31129938,
  "parent" : 31120094,
  "text" : "I still lament that &quot;streaming&quot; is considered a unique &quot;new thing&quot; rather than the evolution of all the media rental businesses before it.<p>&quot;First Sale Doctrine? Who cares!&quot; -Big Media (probably)<p>The whole &quot;you&#x27;re stealing&quot; comment thread (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31123354\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31123354</a>) is clear byproduct of all this, with people talking past each other.<p>**<p>I can buy a DVD, and loan that DVD out to 1000 friends. Everyone enjoys the movie without paying a dime. The movie studio only makes money of that first DVD sale to me.<p>--&gt; This is legal and considered moral and normal by ~everyone.<p>Governments around the world can do the same as a public service with libraries that lend out all sorts of media. And, once again, the media right holders only get paid that first sale.<p>---&gt; This is legal and considered moral and normal by ~everyone; and is democratically approved, government sanctions, public good.<p>Blockbuster and OG Netflix (DVD-by-mail) can buy 1000s of DVDs. Rent them out for profit. Once again, the media companies only profit off those first sales. No pay for view, pay for rental, etc royalty or extra cost.<p>---&gt; Again, legal, moral, the way things were for decades.<p>---&gt; More so, Netflix could buy and rent out whatever movies they wanted. Media companies couldn&#x27;t deny them, no negotiations needed. Thus, Netflix had a fantastic movie catalog, the world was happy.<p>---&gt; Heck, Netflix could even resale many of these DVDs months later on the used market to make-up costs. Eg. stock up for blockbuster launches, downsize later. Again, zero additional cut given to the media companies.<p>**<p>- Netflix the DVD-by-mail company was built on first sale doctrine.<p>- Netflix the &quot;DVD-by-email&quot; (streaming) company normalized a model that bypasses it, let media companies re-write the rules under the specter of piracy, and ultimately disrupted themselves.<p>- Sure, their value skyrocketed as the harbinger of the streaming era, but likely sealed their long-term fate in the process.<p>**<p>Steaming being &quot;different&quot; is kinda just an accident of history too. Imagine a timeline that turned out different and treated streaming as an evolution of renting tapes -&gt; DVDs -&gt; Blu-rays.<p>A hypothetical world where Netflix:<p>- Buys N digital copies of some show, and can only stream to N people at once.<p>- If I&#x27;m N+1, Netflix tells me &quot;All copies are currently being streamed. We estimate a copy being available in 10 minutes. Would you like to join the queue? Feel free to watch Y (recommended by your viewing history!) while you wait. We&#x27;ll notify you once available and you have up to 30 minutes to start watching before your reservation expires.&quot;<p>- All in all, basically the same as the old Netflix DVD era, where we had queues, multiple DVDs in the mail so we always had something to watch every night, etc. Just faster.<p>This alternate timeline would lead to multiple competing ventures, no way for media holders to pick&#x2F;choose services (eg. no &quot;only on X&quot; nonsense) and everyone competing on price, quality, catalog (eg. blockbusters vs all-the-things vs speciality, etc)<p>It&#x27;s a shame that simply using a faster postal service (eg. Internet) reclassifies the entire venture into something completely different, and gave media right holders more power over end-user-distribution than all proceeding home viewing formats.<p>**<p>Addendum<p>If someone ever invents a teleportation device (yeah, I know...let me dream), I&#x27;ll happily pour all my money into a &quot;DVD by Portal&quot; business to recorrect history and get us to a world that is both consumer friendly + convenient.<p>Such a same that digital teleportation vs physical teleportation forces us to pit convenience vs everything else.",
  "time" : 1650673174,
  "type" : "comment"
}
