{
  "by" : "Stunting",
  "id" : 31123354,
  "kids" : [ 31124136, 31124806, 31123454, 31123607, 31123555, 31126109, 31123595, 31123700, 31123556, 31124642, 31126864, 31125396, 31123553, 31123991, 31123841, 31123730, 31123616, 31126243, 31127148, 31124465, 31127008, 31124906, 31124735, 31124883, 31126167 ],
  "parent" : 31122389,
  "text" : "You&#x27;re stealing income, specifically from me and all of my coworkers. Perhaps you think that you&#x27;re only stealing from Producers and A list actors, but there are entire departments that receive residuals on a production.<p>- On screen performers, stunt performers like myself and actors who grind out a comfortable living. Those residuals also go to qualifying for health insurance through earnings. You are directly stealing from my ability to provide health insurance to my family.<p>- Assistant Directors, who are saints dealing with every logistical problem imaginable. The best of them only work 1-2 movies a year because the workload causes severe burnout.<p>- The Union themselves! The more money that flows through the union, the more powerful they are. The more safer movie sets become and the better life is provided for the workforce that makes your entertainment.<p>- Yourself! You are reducing the value of producing quality TV and Movies by stealing them. Every time one a show is pirated, there is less incentive to spend more money on an entertainment spectacle.<p>Go check out my imdb and see how many of my credits you&#x27;ve watched\n<a href=\"https:&#x2F;&#x2F;www.imdb.com&#x2F;name&#x2F;nm1968249&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.imdb.com&#x2F;name&#x2F;nm1968249&#x2F;</a><p>For every show imagine that it&#x27;s a nickel you stole from my income. WOuldn&#x27;t be surprised if you took a buck or two out of mine. Now multiply that by all the on screen performers and ADs and others I mentioned. Now multiply that all the people who steal like you.<p>You&#x27;re directly responsible for sucking the quality of life away from people who make your entertainment and reducing the desire to make things you enjoy. You&#x27;re going to end up with shows that are AI generated CGI sponsored by Mt. Dew and Chevy trucks.<p>Stop stealing our shit.",
  "time" : 1650643287,
  "type" : "comment"
}
