{
  "by" : "Kranar",
  "id" : 31127566,
  "kids" : [ 31128886 ],
  "parent" : 31127303,
  "text" : "I mean almost every single one of them prior to the rise of Christianity and the influence of modern western culture. The Chinese had no qualms with gay marriage or homosexuality in general, there are records of famous Japanese Samurais who married one another, Native Americans have the concept of two-spirit marriages, numerous Roman Emperors married male husbands, and neither the Greeks or Egyptians differentiated much between homosexual or heterosexual relationships.<p>The decline in same-sex marriage, and same-sex relationships in general can be predominantly attributed to the changing attitudes about sex that came about with the rising influence of Christianity. Christianity did not just ban same-sex relationships, it advocated for sexual abstinence in general, forbidding any form of sex outside of marriage and even within marriage promoting sex as strictly for the purpose procreation going so far as to forbid the use of contraceptives, oral&#x2F;anal sex and even masturbation. There are numerous reasons for why this change in attitude gained popularity from economic reasons to major shifts in demographics due to the outbreak of numerous wars in the 3rd century resulting in, among other things, growing discrepancies between the number of men and women.<p>It would take on the order of a thousand years before attitudes on sex became more liberal, with the Anglican church among the first to formally permit the use of contraceptives, and Protestant movements recognizing sexual acts between husband and wife as serving a &quot;unitive&quot; purpose rather than strictly procreation.<p>The point is to say that homosexuality was a casualty of very strict views on sexual relationships in general that came about with the rise of Christianity, but prior to that most societies didn&#x27;t care to think much of it one way or another. Some people like vanilla, some people like chocolate; why would the people who like vanilla care too much about the people who enjoy chocolate?",
  "time" : 1650658997,
  "type" : "comment"
}
