{
  "by" : "chernevik",
  "id" : 31128886,
  "kids" : [ 31130048, 31130318 ],
  "parent" : 31127566,
  "text" : "&gt; numerous Roman Emperors married male husbands<p>Ok, name two.<p>&gt; The decline in same-sex marriage, and same-sex relationships in general can be predominantly attributed to the changing attitudes about sex that came about with the rising influence of Christianity<p>Name a same-sex marriage in pre-Christian Greece or Rome.<p>The Greeks had no problem with homosexuality, Plato is full of jokes about it.  And it wasn&#x27;t that big a deal among the Romans, Julius Caesar&#x27;s own legions would sign songs about his escapades.  But I don&#x27;t know of any evidence that it was ever the basis of a household.  None of the great Greek dramaturges bothered to write a play noticing it.<p>&gt; There are numerous reasons for why this change in attitude gained popularity from economic reasons to major shifts in demographics due to the outbreak of numerous wars in the 3rd century resulting in, among other things, growing discrepancies between the number of men and women.<p>I don&#x27;t know where you&#x27;re getting this stuff, I know a fair amount of history and I&#x27;m aware of nothing so remarkable as a shift in gender balance in the 3rd century.<p>&gt; homosexuality was a casualty of very strict views on sexual relationships in general that came about with the rise of Christianity<p>I don&#x27;t think Christianity&#x2F;Christians have ever cared that much about it, really.  They&#x2F;it think it wrong and immoral, sure, but it isn&#x27;t something that has ever attracted an enormous amount of attention or effort.  It wasn&#x27;t important enough to get much attention from Chaucer, Dante, Bocaccio, Shakespeare -- none of whom were shy about the range of human experience.<p>I know there are historians of gay sexuality, of which I am ignorant, but as a layman familiar with some of the core texts, my impression is that the overall view was &quot;eh, whatever&quot;.",
  "time" : 1650665705,
  "type" : "comment"
}
