{
  "by" : "jillesvangurp",
  "id" : 31120918,
  "parent" : 31120094,
  "text" : "Higher prices, lower quality content. That&#x27;s the sum of my current gripes with Netflix. I&#x27;m considering pausing my subscription until there&#x27;s enough for me to watch again. Netflix is sacrificing content for profit and squeezing people harder for the same reason: the completely unsurprising result: people vote with their feet. Publicly pondering adding ads to the mix is not going to improve things.<p>My suggestions:<p>- invest in licensing deals for existing content. More premium content, less generic filler content. As much as I appreciate Steven Segal, his later work is not great; to put it mildly. And it seems they unloaded a lot of that recently (at least on the German Netflix). That, and generic Korean action movies&#x2F;series seems to be a thing lately. What&#x27;s up with that? There are back catalogs of great content dating back decades around the world that are hardly being monetized at all currently. Probably there&#x27;s an audience for that. It shouldn&#x27;t be that hard to get good content. And it should be a lot cheaper than producing your own new content.<p>- invest in more &amp; better in house content, that&#x27;s a strategy that has worked in the past. No reason why that would no longer work. But make sure the quality is high. Especially a lot of the Netflix movies have been expensive flops.<p>- invest in re-acquiring lost customers (discounts, outreach, etc.). Easy because they left because they didn&#x27;t like the content or the price. So, fix that and they might come back. You know what they liked and thus which of those issues it is. Customer acquisition cost for 200K users is not going to be nothing. But that&#x27;s 30M&#x2F;year in revenue or so.<p>- crack down on obvious password sharing abuse but give people a good way out in terms of cost and make sure they don&#x27;t have a hard time with perfectly valid uses by families. Converting families to individual subscriptions is just not going to happen. So, avoid losing them because things get too expensive. Kids watching now on a family account may become life time users once they move out. A genius move would be to have 1 password per profile and only allow 1 device to be watching with a profile at the time. That makes it quite obvious how many people are using the account. Some people have many kids. Perfectly legit to have 6 or so profiles in some larger families. But you can track where people watch (same ip address?) and take action when the abuse is obvious. Mobile uses are even easier: simply verify the phone number. Etc.<p>- squeeze the competition hard by lowering prices; make sure value for money is bets with Netflix. Growth will come at the cost of the competition. Right now Netflix is losing this game.<p>- change the leadership, Netflix is not performing well and the current issues have been widely predicted by outsiders; which means they are not listening either. That&#x27;s a double fail. And a triple fail if you consider that Netflix takes pride in being a data driven company. The content issues should be fairly obvious from the data they are gathering. The effect of the pricing changes, should not have come as a surprise either. It&#x27;s not data driven if the algorithm tells you only what you want to hear. And I suspect the algorithms were fine and management just simply ignored the output of that.",
  "time" : 1650631455,
  "type" : "comment"
}
