{
  "by" : "everdrive",
  "id" : 31137778,
  "parent" : 31130809,
  "text" : "It would certainly be disingenuous to say that TV shows did not have political themes in previous eras: obviously they did. I believe what&#x27;s different now is simply the speed of change and extremity of political viewpoints. This debate is sort of similar to when people worry about misinformation on social media, and someone answers back &quot;well there&#x27;s always been bias and misinformation in the news.&quot; This is true, but it fails to address that the nature of the problem is different now than in previous eras.<p>I think what you have these days is a splintering of the mainstream, and the rise of extremist viewpoints. Both of these, in my opinion are due to social media.<p>In the 80s, (and before) there was a true mainstream culture. For certain, people fell outside of that culture, and if you did fall outside of the mainstream I believe the consequences were harsher than they would be nowadays. But, broadly speaking, that mainstream culture encompassed more Americans than the mainstream culture of today. In modern times, there is no real majority mainstream culture, and because of this centralized media is reflective of a smaller and smaller portion of the country. In other words, there are simply going to be a larger number of people who might not feel represented by views and positions they watch in TV or hear on the news. And to be clear, I&#x27;m not talking about &quot;racial representation here.&quot; I explicitly do not mean that &quot;if I don&#x27;t see a person of my race or gender in a show, I don&#x27;t feel represented.&quot; I mean instead that the social and political values of a given show today reflect the views of a smaller percentage of Americans than the political and social values of a show in the 50s or 80s.<p>I&#x27;m not even arguing that this is a bad thing in the objective sense: simply that the political views of the current &quot;mainstream&quot; feel narrow and extremist to me, to the extent that I just don&#x27;t want to watch a lot of popular shows.",
  "time" : 1650743250,
  "type" : "comment"
}
