{
  "by" : "sofal",
  "id" : 31130520,
  "kids" : [ 31130763, 31131000 ],
  "parent" : 31129745,
  "text" : "&gt; <i>Almost nobody is against LGBT characters or show that have woke politics in them.</i><p>I’m not sure why you would think this. There is a huge segment of society that is very much against everything that could possibly be considered “woke”. They use the term “woke” as an insult and as something that is obviously bad on its face and by definition. They have a huge amount of political power, and may soon have an iron grip on political power in the US. I grew up among these people and was one of them for a long time. They believe:<p>* Gay relationships are an abomination, and any media that indicates otherwise is offensive politics and should be banned from schools.<p>* Women have specific child rearing and housekeeping roles ordained by God, and any media that indicates otherwise is offensive politics<p>* Christianity (or their brand of it) is meant to be respected at all times, and should be a core value of government<p>* Racism has been over since [slavery ended|civil rights era] and it’s high time for those communities to get over it and stop bothering those poor brave police officers and smashing those storefront windows all the time. Any form of education on the topic should be banned from schools.<p>It has been my experience that the people I grew up with who I <i>know</i> believe all the above are <i>constantly</i> wrapping their views in generic complaints about “woke-ism”. It is been my experience with people online that if you dive deeper into specifics or look at comment history of posters who actively and constantly decry “woke politics”, you often eventually get rants about white genocide or some other conspiracies that tend to ship in the same container. I think it’s always important to talk specifics, because I guarantee you that when e.g. my dad tells you that a show’s “woke-ism” is ruining it (and he definitely will tell you that), it’s because he finds gay behavior to be deeply disgusting and immoral.<p>That being said, thank you for some of those specifics. I’d really like to be shown otherwise, even if it’s one person at a time.<p>So your WoT example intrigues me. That’s the only show I’ve seen among those, but I do want to see Arcane (it’s on my list). I still don’t see how the “woke” part does the ruining, and maybe it comes down to whether you ascribe the boringness of the relationships or the Aes Sedai partners to be inherently caused by the fact that the roles are non-traditional in terms of genders. Where you see forced woke-ism causing boringness, I’d probably see as just plain old boring (which, eh, it’s entertaining enough for me, but not the best; it’s been such a long time since I read those books and I’m not sure I’d be as into the original source material nowadays anyway). The fact that the roles are non-traditional is at the very least novel when compared to the massive amount of history and media that has and continues to be the exact opposite. I have probably sat through over 100 full shows and movies where all of the women were defined solely by their relationship with powerful men. One more “boring” show that happens to be the opposite is not something I’d take to the internets to specifically decry, and if I did, I wouldn’t blame the boringness on the fact that this time the powerful important people were women.<p>&gt; <i>The same in the past would apply to war propaganda movies. If its a very well done and executed it can be great content. But most that produced with that goal in mind is just lame.</i><p>Agreed. But this applies to every single kind of message or moral of the story that the writer is attempting to convey. However, all I hear about here on the internet these days and from this forum is that woke-ism <i>specifically</i> is a poison pill. For me, I’m all for seeing LGBT representation and awareness of the experience of minorities, etc. There is a moral aspect of that that I appreciate. I also appreciate good writing, pacing, storyline, cinematography, etc. I don’t think the former inherently poisons or guarantees the latter.",
  "time" : 1650677659,
  "type" : "comment"
}
