{
  "by" : "panick21_",
  "id" : 31131000,
  "parent" : 31130520,
  "text" : "&gt; I’m not sure why you would think this. There is a huge segment of society that is very much against everything that could possibly be considered “woke”.<p>I agree. That was badly phrased. I was more talking about my experience in talking with people in my country and social circle.<p>But even then, shows like Arcane have very, very few people riled up about &#x27;wokism&#x27; and whatever. I have not heard a single reviewer or commentator say anything negative about the lesbian relationship or the fact that the most powerful political operators are black women.<p>&gt; you often eventually get rants about white genocide or some other conspiracies<p>That&#x27;s like because people who have far more normal and common views don&#x27;t engage in these discussion. I tend to stay out of them as well, but the economic angle of Netflix interested me and I got baited into responding to a comment.<p>:)<p>&gt; I still don’t see how the “woke” part does the ruining<p>Just to be clear, I think the show is terrible in a whole number of ways. What we in general call &quot;wokism&quot; would not be in my top complaints about the show. Its something that I consider annoying not some great sin or something. But I do think that general approach did impact the overall approach they took to writing the show and it made the end product much worse.<p>&gt; I have probably sat through over 100 full shows and movies where all of the women were defined solely by their relationship with powerful men. One more “boring” show that happens to be the opposite is not something I’d take to the internets to specifically decry, and if I did, I wouldn’t blame the boringness on the fact that this time the powerful important people were women.<p>As I said, nobody would decry such a show if it was not based on popular source material. And I am certainty not defending other bad media that have bad writing and those things have of course been criticized rightly. But the existent of the opposite doesn&#x27;t mean we should stop criticizing it.<p>The reason I use it as an example is because it is source material that already has powerful amazing woman of different types in it. But the writers of the show felt the need to take this up to an almost absurd degree and did the opposite with the male characters.<p>Let me give you an example of what I am talking about, I think you interpreted my comment very narrowly. I don&#x27;t care that men have non traditional roles or are defined by their relationship to a powerful woman. Such characters are often part of stories and that is fine. I am more talking about turning characters who were more then that into that.<p>There are many examples we could talk about. To be clear, non of those individually are all that relevant or worth complaining about. Its only in aggregate when it gets worthy of critic.<p>Agelmar Jagad in the books is highly respected competent leader and general, living in a culture with very high respect for woman. His sister is competent highly respected noble woman is a trusted adviser and the second most powerful person in the city. Jagad will be a off and on relevant character for the rest of the books. Sound reasonable?<p>Agelmar Jagad in the show is portrayed as stereotype alpha male general with no brain. They forced a sub-plot into the show where his sister literally has to wear the ancient armor of the house (that the show made up) to lead a group of woman to fix what the men are to dumb to do. Ah and the sister who was non-magical in the book of course had to be elevated from just politically powerful to a super-powerful magic user as well. She is of course vital in winning the battle at the end, Jagad will of course be killed instantly like a total bitch, certainty nobody will miss this toxic male and he will likely not be mentioned again.<p>So the writers felt the need to totally rewrite that part of the source material. Why? These were pretty minor characters and the show runners already excused many of their changes on only being granted 8 episodes. Yet we had to spend major screen-time on another sub-plot where the evil alpha-male messes everything up and then the all-powerful woman to come in the save the situation.<p>Its a totally unnecessary plot shoehorned into the story with no relevance to the main story the show is trying to tell. The source material had brother sister team working together, but we can&#x27;t miss an opportunity to rewrite it into incompetent alpha male&#x2F;wonder woman narrative. That is a perfect example of force feeding &#x27;woke-ism&#x27; into a story.<p>Again, this alone isn&#x27;t a big deal. But this approach is pretty consistently applied.<p>&gt; Agreed. But this applies to every single kind of message or moral of the story that the writer is attempting to convey. However, all I hear about here on the internet these days and from this forum is that woke-ism specifically is a poison pill.<p>I certainty agree that there is an over-focus on crisis of woke-ism and many-times unfairly so. For me this is not &#x27;culture war&#x27; for civilization, rather annoying meme that makes TV show potentially worse then they could have been.<p>To give specific example in Wheel of Time. In the book the &#x27;Two Rivers&#x27; is a part of Andor. Andor is basically the Britain of that universe. Given its history and isolation, &#x27;Two Rivers&#x27; is very culturally and racially homogeneous.<p>In the show the &#x27;Two Rivers&#x27; looks racially more like New York City. This certainty makes little sense from a story telling perspective. Cultures that are very isolated for 1000s of years simple are not that diverse. Now you can certainty change that from something based on white rural Britain to whatever other racial group want to insert.<p>You can of course explain this away in whatever way you want, its fantasy. Genetics might work different. Who cares. You don&#x27;t even have to explain it at all.<p>One of my friends had a problem with this diversity suggesting it hurts the story and that priority should be an accurate representation of isolated cultures. He would have been fine with that being non-white of some kind.<p>I said, while I agree that it doesn&#x27;t really serve the story, when creating a major 100+ million$ TV show with 5 lead actors all from the same village making them totally culturally and racial homogeneous isn&#x27;t really all that practical. A am willing to throw overboard some story purity (or strict adherence to the source) as to give a diverse group of actors to chance to get a role in such a show.<p>PS: Pretty much all those actors doing a great job! That was the least of the shows problem. Fire the writers and keep the actors.",
  "time" : 1650683259,
  "type" : "comment"
}
