{
  "by" : "chrononaut",
  "id" : 31131019,
  "parent" : 31130912,
  "text" : "What are you exactly disputing here?<p>&gt; Pieces like this are the telephone game played by ideologues. Get a couple of articles published, never mind the sourcing or review, cite them as &quot;scholarly&quot; and voila! evidence of . . . whatever the hell it is you want evidence of.<p>Then why are you asking for people to cite evidence which you are recognizing wouldn&#x27;t have had the literary capacity to exist? You&#x27;re asking for everyone to prove something when little remains of written record, which for all intents and purposes, largely seemed like a rather irrelevant thing to highlight, as you acknowledged in your sister comment:<p>&gt; The Greeks had no problem with homosexuality, Plato is full of jokes about it. And it wasn&#x27;t that big a deal among the Romans, Julius Caesar&#x27;s own legions would sign songs about his escapades. But I don&#x27;t know of any evidence that it was ever the basis of a household. None of the great Greek dramaturges bothered to write a play noticing it.<p>Maybe another way of framing this: There are 170,000 same-sex married couples in the US in 2013[0] out of 59.2 million total marriages[1]. Assuming this is an extremely rough approximation of the ratio of homosexual to heterosexual relationships throughout history (which is definitely influenced by a lot of factors), can you provide us with proof for 350 Roman or Greek marriages that qualify with your record integrity?<p>[0] <a href=\"https:&#x2F;&#x2F;www.pewresearch.org&#x2F;fact-tank&#x2F;2015&#x2F;06&#x2F;24&#x2F;how-many-same-sex-married-couples-in-the-u-s-maybe-170000&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pewresearch.org&#x2F;fact-tank&#x2F;2015&#x2F;06&#x2F;24&#x2F;how-many-sa...</a>\n[1] <a href=\"https:&#x2F;&#x2F;www.statista.com&#x2F;statistics&#x2F;183663&#x2F;number-of-married-couples-in-the-us&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.statista.com&#x2F;statistics&#x2F;183663&#x2F;number-of-married...</a>",
  "time" : 1650683535,
  "type" : "comment"
}
