{
  "by" : "Lammy",
  "id" : 31132329,
  "parent" : 31127630,
  "text" : "&gt; the difference in resolution and image quality is insanely noticeable on, especially 4K, TV’s<p>It&#x27;s possible to make them look a lot better, but you&#x27;re right that it&#x27;s a huge amount of work to do so. There&#x27;s basically nothing out there tagged &quot;DVDRip&quot; that&#x27;s worth a damn IMO, because almost all encoders (both human and software) treat the DVD like encoding a CD where making the most exact copy of what&#x27;s on the disc is the goal.<p>Encoding a DVD for modern screens on the other hand requires some art direction all its own. DVDs have a huge amount of legacy hidden in them, not only in the interlaced NTSC&#x2F;PAL systems but in Sony&#x27;s D-1 tape system as well: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;D-1_(Sony)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;D-1_(Sony)</a><p>A good modern DVD rip will be:<p>- Deinterlaced to 60FPS (technically 60000&#x2F;1001 fields-per-second) using a temporal-smoothing filter like QTGMC. Handbrake will not do this. Almost all DVD rips are 30FPS and just look gross and feel gross from all the lost motion information.<p>- Cropped to avoid the black bars on the left and right of the D-1 resolution and to make circles into circles instead of slight ovals. This is really noticeable in cartoons with circle-guides for eyes like The Simpsons.<p>- Stretched to 960x540 (16:9) or 720x540 (4:3) at encode-time with a quality resize filter. This is probably the part nerds have the most internalized opposition to (I sure did) since the raw NTSC DVD res is 720x480 and expanding it feels kind of like encoding a FLAC out of an MP3. All DVDs are anamorphic (704x486 is a 3:2 res, stretched equally for both 16:9 and 4:3 DAR!), so the alternative is that the display performs the stretch in real-time using the container PAR&#x2F;DAR flags. Most displays do a terrible job.<p>The vertical 540px is the EDTV resolution and still part of the ATSC spec to this day, technically as 544px with four dead pixel rows on the bottom for 8px block size. I&#x27;ve yet to meet a decoder fail with 4px blocks though so I prefer the panel-accurate res. It pixel-doubles in exact multiples to 1080, 2160, etc, so it looks way better on modern screens.<p>- Color-corrected from the oldschool D-1 colorspace to the newer HDTV or 4K colorspaces, or at least tagged as such if not converted. This doesn&#x27;t undo the lossy nature of subsampled chroma but still looks a lot better, especially in the greens. This is another thing that cheap displays are terrible at doing in realtime: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Rec._601\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Rec._601</a><p>- Rip the raster-based DVD subtitles to a modern format like SRT&#x2F;ASS. I usually use SubtitleEdit and correct the few OCR errors by hand: <a href=\"https:&#x2F;&#x2F;www.nikse.dk&#x2F;SubtitleEdit&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nikse.dk&#x2F;SubtitleEdit&#x2F;</a><p>- Encode AC3 audio to AAC, preferably with something nicer than FAAC. I include all languages because why not. I like FDK-AAC and will use VBR-4 or VBR-5 if I want low-pass or not based on the source waveform: <a href=\"https:&#x2F;&#x2F;wiki.hydrogenaud.io&#x2F;index.php?title=Fraunhofer_FDK_AAC\" rel=\"nofollow\">https:&#x2F;&#x2F;wiki.hydrogenaud.io&#x2F;index.php?title=Fraunhofer_FDK_A...</a><p>- MKV container, take the time to fill the container metadata fields, tag audio track languages so the player picks the correct one, attach a `cover.jpg` for Explorer&#x2F;Finder thumbnail, name all the chapter stops, etc. This is actually grueling some times. My precious metadata.<p>Totally huge pain. Worth it though for things worth having :)",
  "time" : 1650700680,
  "type" : "comment"
}
