{
  "by" : "someguydave",
  "id" : 31141249,
  "parent" : 31140024,
  "text" : "&gt;And more often than not, technique is what helps people prevail in fights, not strength.<p>Find me a credible source that claims this.  After all, we certainly don&#x27;t group wrestlers into weight categories because of differences in technique?<p>&gt;The claim is that women can be as strong as men, and that isn’t totally false. Maybe not the strongest men, but certainly a lot of them, and especially if they train well.<p>That claim is simply false.  The most extreme female athletes come close to achieving parity with an average untrained man.  There are almost none of these - certainly not &quot;a lot of them&quot;.  The vast majority of women are much weaker than even the weakest men.<p><a href=\"https:&#x2F;&#x2F;pubmed.ncbi.nlm.nih.gov&#x2F;17186303&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;pubmed.ncbi.nlm.nih.gov&#x2F;17186303&#x2F;</a>\n&quot;Less expected was the gender related distribution of hand-grip strength: 90% of females produced less force than 95% of males. Though female athletes were significantly stronger (444 N) than their untrained female counterparts, this value corresponded to only the 25th percentile of the male subjects.&quot;<p>&quot;The results of female national elite athletes even indicate that the strength level attainable by extremely high training will rarely surpass the 50th percentile of untrained or not specifically trained men.&quot;<p>&gt;Also, there seems to be a thin veil of sexism in your claim,<p>I appreciate your candor.<p>&gt; as though women aren’t capable of thinking for themselves<p>The problem is that everyone (men and women) thinks of themselves as the special snowflake who can &quot;beat the odds&quot;.  I think that the message to women &quot;You are very likely weaker than the weakest men you know&quot; avoids much more harm (case 1 direct harm) than the &quot;good&quot; generated by: &quot;it&#x27;s extremely unlikely but with good genetics and training it&#x27;s a possibility that some extreme athlete women could become nearly as strong as a below-average man&quot;.",
  "time" : 1650773633,
  "type" : "comment"
}
